{
  "resourceType": "OperationDefinition",
  "name": "export",
  "title": "Pathling Export Operation",
  "status": "active",
  "kind": "operation",
  "experimental": false,
  "publisher": "Australian e-Health Research Centre, CSIRO",
  "description": "This operation allows data to be exported from the Pathling server in NDJSON, Parquet, or Delta Lake format. The operation follows the FHIR Bulk Data Access specification for system-level export, supporting asynchronous export of FHIR resources.",
  "affectsState": false,
  "code": "export",
  "system": true,
  "type": false,
  "instance": false,
  "parameter": [
    {
      "name": "_outputFormat",
      "use": "in",
      "min": 0,
      "max": "1",
      "documentation": "The format for the requested export files. Pathling supports NDJSON, Parquet, and Delta Lake formats. Accepted values for NDJSON are 'application/fhir+ndjson', 'application/ndjson', and 'ndjson'. Accepted values for Parquet are 'application/x-pathling-parquet' and 'parquet'. Accepted values for Delta Lake are 'application/x-pathling-delta+parquet' and 'delta'. Defaults to NDJSON if not specified.",
      "type": "string"
    },
    {
      "name": "_since",
      "use": "in",
      "min": 0,
      "max": "1",
      "documentation": "Resources will be included in the response if their state has changed after the supplied time (i.e., if Resource.meta.lastUpdated is later than the supplied _since time).",
      "type": "instant"
    },
    {
      "name": "_until",
      "use": "in",
      "min": 0,
      "max": "1",
      "documentation": "Resources will be included in the response if their state has changed before the supplied time (i.e., if Resource.meta.lastUpdated is earlier than the supplied _until time).",
      "type": "instant"
    },
    {
      "name": "_type",
      "use": "in",
      "min": 0,
      "max": "*",
      "documentation": "A comma-delimited list of FHIR resource types. Only resources of the specified types will be included in the export. If this parameter is omitted, all supported resource types will be exported, subject to authorisation constraints. If an unsupported or invalid resource type is specified, the server will return an error unless the 'Prefer: handling=lenient' header is included, in which case the unsupported type will be ignored.",
      "type": "string"
    },
    {
      "name": "_elements",
      "use": "in",
      "min": 0,
      "max": "*",
      "documentation": "A comma-delimited list of FHIR elements to include in the exported resources. Elements must be specified as either '[resource type].[element name]' (e.g., 'Patient.name') to apply to a specific resource type, or '[element name]' (e.g., 'id') to apply to all resource types. Only top-level elements are supported. Mandatory elements will always be included regardless of this parameter. Resources will be marked with the SUBSETTED tag when this parameter is used.",
      "type": "string"
    }
  ]
}
