{
  "resourceType": "OperationDefinition",
  "id": "aggregate-2",
  "url": "https://pathling.csiro.au/fhir/OperationDefinition/aggregate-2",
  "name": "aggregate",
  "title": "Pathling Aggregate Operation",
  "status": "active",
  "kind": "operation",
  "experimental": true,
  "publisher": "Australian e-Health Research Centre, CSIRO",
  "description": "This operation allows a user to perform aggregate queries on data held within the FHIR server by specifying aggregation, grouping and filter expressions.",
  "affectsState": false,
  "code": "aggregate",
  "system": true,
  "type": false,
  "instance": false,
  "parameter": [
    {
      "name": "subjectResource",
      "use": "in",
      "min": 1,
      "max": "1",
      "documentation": "The subject resource that the expressions within this query are evaluated against.",
      "type": "code",
      "binding": {
        "strength": "required",
        "valueSet": "http://hl7.org/fhir/ValueSet/resource-types|4.0.0"
      }
    },
    {
      "name": "aggregation",
      "use": "in",
      "min": 1,
      "max": "*",
      "documentation": "An expression which is used to calculate a summary value from each grouping.",
      "part": [
        {
          "name": "expression",
          "use": "in",
          "min": 1,
          "max": "1",
          "documentation": "A FHIRPath expression that defines the aggregation. The context is a collection of resources of the type specified in the subjectResource parameter. The expression must evaluate to a primitive value.",
          "type": "string"
        },
        {
          "name": "label",
          "use": "in",
          "min": 0,
          "max": "1",
          "documentation": "A short description for the aggregation, for display purposes.",
          "type": "string"
        }
      ]
    },
    {
      "name": "grouping",
      "use": "in",
      "min": 0,
      "max": "*",
      "documentation": "A description of how to group aggregate results.",
      "part": [
        {
          "name": "expression",
          "use": "in",
          "min": 1,
          "max": "1",
          "documentation": "A FHIRPath expression that can be evaluated against each resource in the data set to determine which groupings it should be counted within. The context is an individual resource of the type specified in the subjectResource parameter. The expression must evaluate to a primitive value.",
          "type": "string"
        },
        {
          "name": "label",
          "use": "in",
          "min": 0,
          "max": "1",
          "documentation": "A short description for the grouping, for display purposes.",
          "type": "string"
        }
      ]
    },
    {
      "name": "filter",
      "use": "in",
      "min": 0,
      "max": "*",
      "documentation": "A FHIRPath expression that can be evaluated against each resource in the data set to determine whether it is included within the result. The context is an individual resource of the type specified in the subjectResource parameter. The expression must evaluate to a singular Boolean value. Multiple filters are combined using AND logic.",
      "type": "string"
    },
    {
      "name": "grouping",
      "use": "out",
      "min": 0,
      "max": "*",
      "documentation": "The grouped results of the aggregations requested in the query. There will be one grouping for each distinct combination of values determined by executing the grouping expressions against each of the resources within the filtered set of subject resources.",
      "part": [
        {
          "name": "label",
          "use": "out",
          "min": 0,
          "max": "*",
          "documentation": "The set of descriptive labels that describe this grouping, corresponding to those requested in the query. There will be one label for each grouping within the query, and the type of each label will correspond to the type returned by the expression of the corresponding grouping. A grouping expression that results in an empty collection will yield a null label, which is represented within FHIR as the absence of a value.",
          "type": "Type"
        },
        {
          "name": "result",
          "use": "out",
          "min": 1,
          "max": "*",
          "documentation": "The set of values that resulted from the execution of the aggregations that were requested in the query. There will be one result for each aggregation within the query, and the type of each result will correspond to the type returned by the expression of the corresponding aggregation.",
          "type": "Type"
        },
        {
          "name": "drillDown",
          "use": "out",
          "min": 0,
          "max": "1",
          "documentation": "A FHIRPath expression that can be used as a filter to retrieve the set of resources that are members of this grouping. This will be omitted if there were no groupings or filters passed within the query.",
          "type": "string"
        }
      ]
    }
  ]
}
